{
    "item":
    [{
        "id": "1",
        "term":"DevOps",
        "description":"DevOps is a set of practices, tools, and a cultural philosophy that automate and integrate the processes between software development and IT teams.",
        "references":"Atlassian (2016). What is DevOps? | Atlassian. [online] Atlassian. Available at: https://www.atlassian.com/devops."
    },
    {
        "id":"2",
        "term":"CI/CD",
        "description":"CI/CD is a method to frequently deliver apps to customers by introducing automation into the stages of app development.",
        "references":"Redhat (2019). What is CI/CD? [online] Redhat.com. Available at: https://www.redhat.com/en/topics/devops/what-is-ci-cd."
    },
    {
        "id":"3",
        "term":"Agile",
        "description":"The Agile methodology is a project management approach that involves breaking the project into phases and emphasizes continuous collaboration and improvement. Teams follow a cycle of planning, executing, and evaluating.",
        "references":"Atlassian (2019). Agile best practices and tutorials | Atlassian. [online] Atlassian. Available at: https://www.atlassian.com/agile."
    },
    {
        "id":"4",
        "term":"Automation",
        "description":"The application of technology, programs, robotics or processes to achieve outcomes with minimal human input.",
        "references":"IBM (2021). What is automation? [online] www.ibm.com. Available at: https://www.ibm.com/topics/automation."
    },
    {
        "id":"5",
        "term":"DevSecOps",
        "description":"DevSecOps stands for development, security, and operations. It's an approach to culture, automation, and platform design that integrates security as a shared responsibility throughout the entire IT lifecycle.",
        "references":"Redhat.com. (2019). What is DevSecOps? [online] Available at: https://www.redhat.com/en/topics/devops/what-is-devsecops."
    },
    {
        "id":"6",
        "term":"Software Development Life Cycle (SDLC)",
        "description":"The software development lifecycle (SDLC) is the cost-effective and time-efficient process that development teams use to design and build high-quality software. The goal of SDLC is to minimize project risks through forward planning so that software meets customer expectations during production and beyond. This methodology outlines a series of steps that divide the software development process into tasks you can assign, complete, and measure.",
        "references":"Amazon (n.d.). What is SDLC? - Software Development Lifecycle Explained - AWS. [online] Amazon Web Services, Inc. Available at: https://aws.amazon.com/what-is/sdlc/."
    },
    {
        "id":"7",
        "term":"Shift Left Testing",
        "description":"Shift Left testing is a software testing approach that places strong emphasis on conducting testing activities earlier in the development process by shifting all testing activities to earlier development stages rather than leaving until the very final stages.",
        "references":"Katalon (2023). Shift-Left Testing: How to Apply Shift Left Approach to Continuous Testing. [online] katalon.com. Available at: https://katalon.com/resources-center/blog/shift-left-testing-approach [Accessed 30 Jul. 2023]."
    },
    {
        "id":"8",
        "term":"User Acceptance Testing",
        "description":"User Acceptance Testing (UAT), which is performed on most UIT projects, sometimes called beta testing or end-user testing, is a phase of software development in which the software is tested in the 'real world' by the intended audience or business representative.",
        "references":"uit.stanford.edu. (n.d.). User Acceptance Testing | University IT. [online] Available at: https://uit.stanford.edu/pmo/UAT."
    },
    {
        "id":"9",
        "term":"Value Stream Mapping",
        "description":"Value stream mapping (sometimes called VSM) is a lean manufacturing technique to analyze, design, and manage the flow of materials and information required to bring a product to a customer.",
        "references":"Mukherjee, J. (2019). Value Stream Mapping | Atlassian. [online] Atlassian. Available at: https://www.atlassian.com/continuous-delivery/principles/value-stream-mapping."
    },
    {
        "id":"10",
        "term":"Vesion Control",
        "description":"Version control, also known as source control, is the practice of tracking and managing changes to software code.",
        "references":"Atlassian (2019). What is version control. [online] Atlassian. Available at: https://www.atlassian.com/git/tutorials/what-is-version-control."
    }]
}